Revit 2026 API

# WallSweepWallAllowsWallSweep Method

---

Validates that the wall is of a type that may be a host for a wall sweep or reveal.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool WallAllowsWallSweep(
	Wall wall
)
```
```vb
Public Shared Function WallAllowsWallSweep (
	wall As Wall
) As Boolean
```
```cpp
public:
static bool WallAllowsWallSweep(
	Wall^ wall
)
```
```fsharp
static member WallAllowsWallSweep :
        wall : Wall -> bool
```

#### Parameters

wall Wall
     The wall.

#### Return Value

Boolean True if the wall may host a wall sweep, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function excludes curtain walls and the main wall of a set of stacked walls. The wall must be fully regenerated for this function to work correctly.

#### Reference

WallSweep Class

Autodesk.Revit.DB Namespace